Repository: ralight/ralcalc
Catalog: man/po/*.po
Languages: da

source: a simple command line calculator
da: En simpel kommando linje beregner

source: --all
da: --alle

source: --help
da: --hjælp

source: filename
da: Filnavn

source: prefix
da: præfiks

source: equation
da: ligning

source: Description
da: Beskrivelse

source: <command>ralcalc</command> is a command line calculator designed for very quick calculations where perhaps only a single result is wanted without having to start and then quit a program.
da: <command>ralcalc</command> er en kommando linje beregner designet til meget hurtige beregninger hvor måske kun enkelte resultater er ønsket uden og skulle starte og slutte et program.

source: <command>ralcalc</command> is also installed as the <command>=</command> command to make using it even quicker.
da: <command>ralcalc</command> er også installeret så <command>=</command> kommando brugen gør det endnu hurtigere.

source: Options
da: Indstillinger

source: Print out all of the available operators, functions and constants.
da: Udskriv alle tilgænglige operatører, funktioner og kontakter.

source: Display the result in the "1e-3" form rather than using SI prefixes.
da: Vis resultatet i "1e-3" formen istedet for at benytte SI præfikset.

source: Process a list of calculations from a file. See the FILE INPUT section below for more information.
da: Kør en liste af beregninger fra en fil. Se FIL INDDATA sektionen nedenfor for yderligere information.

source: Display usage, version and contact details.
da: Vis brug, version og kontakt detaljer.

source: Process a list of calculations from <filename class="devicefile">stdin</filename>. See the FILE INPUT section below for more information.
da: Kør en liste af beregninger fra <filename class="devicefile">stdin</filename>. Se FIL INDDATA sektionen nedenfor for yderligere information.

source: Only display the result (so hide the input and any errors).
da: Vis kun resultatet (Således inddata og fejl skjules).

source: Display the result in decimal format with neither SI prefixes nor exponent.
da: Vis resultatet i decimal form med hverken SI præfiks eller eksponent.

source: Display the result using a particular SI prefix. This option is ignored if <option>-e</option> or <option>-r</option> is also used.
da: Vis resultatet ved brug af en bestemt SI præfiks. Denne indstilling bliver ignoreret hvis <option>-e</option> eller <option>-r</option> også er i brug.

source: Number Format
da: Tal format

source: Numbers should be input using either "." or "," as a decimal point (this is locale dependent so both may not work in your locale), with no thousands separators.
da: Nummer bør indskrives ved brug af enten "." eller "," som decimal tegn (dette er lokal afhængig så det virker måske ikke i dit lokale), uden tusinde seperator.

source: <command>ralcalc</command> supports SI prefix characters for both input and output: <placeholder-1/>
da: <command>ralcalc</command> understøtter SI præfiks tegn for både inddata og uddata: <placeholder-1/>

source: Numbers of the form 1e-3 are also supported, where the "e" indicates a power of ten. Don't mix and match SI prefixes and "e" in the same number (although 1e-3n is valid, 1ne-3 is not - avoid both for less confusion).
da: Nummerne fra form 1e-3 er også understøttet, hvortil "e" indikere i ti'ende potens. Bland, og samlign ikke SI præfiksene med "e" i samme nummer (selvom 1e-3n er gyldig, 1ne-3 er ikke - undgå begge for mindre forvirring).

source: The SI prefixes supported are: Y, Z, E, P, T, G, M, k, m, u, n, p, f, a, z, y.
da: SI præfiksene der understøttes er: Y, Z, E, P, T, G, M, k, m, u, n, p, f, a, z, y.

source: Operators
da: Operatørene

source: The simple mathematical operators for addition (+), subtraction (-), multiplication (*, x), division (/) and power (^) are supported, with addition and subtraction having the lowest precedence and power having the highest. <placeholder-1/>
da: Den simpleste matmatiske operatør for sammenlægning (+), subtraktion (-), multiplikation (*, x), dividere (/) og potens (^) er understøttet, hvor sammenlægning og subtraktion har laveste prioritet og potensen har den højeste. <placeholder-1/>

source: Brackets ( (), [] ) can be used to control the order in which statements are processed: <placeholder-1/>
da: Klammerne ( (), [] ) kan benyttes til at kontrolere hvilken måde beregningerne udføres: <placeholder-1/>

source: Both the square and round brackets can be used and are both directly equivalent, so [1+2)x3 is also valid. Round brackets are more commonly used in mathematics, but the square brackets (and the "x" for multiplication) are included to try to prevent problems with the shell expanding those characters.
da: Både firkantet og runde klammer kan benyttes og begge er direkte tilsvarende, således [1+2)x3 også er gyldig. Runde klammer er oftere benyttet i matematik, mens firkantet klammer (og "x"'et for multiplikation) er inkluderet for at forhindre problemer med Shell'en udvider disse tegn.

source: <command>ralcalc</command> stores the result of the calculation so that it can be used in the next calculation with the "_" character. <placeholder-1/>
da: <command>ralcalc</command> gemmer resultatet af beregningen således det kan blive benyttet i den næste udregning med "_" tegnet. <placeholder-1/>

source: Functions
da: Funktioner

source: The functions <function>sin</function>, <function>cos</function>, <function>tan</function>, <function>asin</function>, <function>acos</function>, <function>atan</function>, <function>sqrt</function>, <function>log</function> (base 10 logarithm) and <function>ln</function> (natural logarithm) are supported. The trigonometric functions work on radians. The use of brackets is not necessary, but is recommended where precedence may be confusing. The functions have equal precedence to multiplication/division, so care must be taken: <placeholder-1/>
da: Funktionerne <function>sin</function>, <function>cos</function>, <function>tan</function>, <function>asin</function>, <function>acos</function>, <function>atan</function>, <function>sqrt</function>, <function>log</function> (base 10 logaritme) og <function>ln</function> (naturlig logaritme) er understøttet. Trigonometri funktionerne virker på omkreds. Brugen af klammer er ikke nødvendig, men anbefales hvor tidligere udregninger kan være forvirrende. Funktionerne har samme mønster til multiplikation/dividering, så vær varsom: <placeholder-1/>

source: Constants
da: konstante

source: The constants <constant>pi</constant> (3.14159) and <constant>exp</constant> (2.71828) can be used and are treated the same as any other number.
da: konstanterne <constant>Pi</constant> (3.14159) og <constant>exp</constant> (2.71828) can benyttes og behandles som et hvilket som helst andet tal.

source: File Input
da: Fil inddata

source: A list of calculations can be processed at once by placing them in a file. Each line of the file will be process exactly the same as if <command>ralcalc</command> had been run with those arguments. The file could look like the following (note the lack of the command <command>=</command> or <command>ralcalc</command>): <placeholder-1/>
da: En liste af beregninger kan blive kørt ved at placere dem i en fil. Hver linje af filen vil blive kørt på præcist samme måde som hvis <command>ralcalc</command> havde været kørt med disse argumenter. Filen kunne se ud som følgende (bemærk manglen på kommandoer <command>=</command> eller <command>ralcalc</command>): <placeholder-1/>

source: File input is also possible using <filename class="devicefile">stdin</filename>, i.e. reading interactively directly from the terminal with each line being calculated as normal. To quit, type "q" or "quit" on a new line, use Ctrl-D to indicate the end of file, or use Ctrl-C to cause <command>ralcalc</command> to be terminated.
da: Filens inddata er også mulig ved brug af <filename class="devicefile">stdin</filename>, eksempelvis aflæses interaktivt direkte fra terminalen hvor hver linje beregnes normaltvis. For at afslutte, skriv "q" eller "quit" i en ny linje, benyt Ctrl-D for at indikere enden på filen, eller benyt Ctrl-C til at tvinge <command>ralcalc</command> til at lukke ned.

source: If either of the file input options are given on the command line, then any calculations given on the command line will be calculated first. If both of the file input options are given, then the calculations from the <option>-f</option> will be carried out first, followed by those from <filename class="devicefile">stdin</filename>.
da: Hvis begge fil inddata indstillinger er tilstede på kommando linjen, da vil først givne kommando blive udregnet først. Hvis begge fil inddata instillinger er tilstede, da vil udregningerne fra <option>-f</option> blive udført først, efterfulgt af dem fra <filename class="devicefile">stdin</filename>.

source: Examples
da: Eksempler

source: Basic calculation: <placeholder-1/>
da: Grundlæggende beregninger: <placeholder-1/>

source: = -e ln 1.0001
da: = -e l 1.0001

source: ln 1.0001 = 9.9995e-05
da: l 1.0001 = 9.9995e-05

source: Exponent number output format: <placeholder-1/>
da: Eksponentens nummer uddata format: <placeholder-1/>

source: = -r ln 1.0001
da: = -r l 1.0001

source: ln 1.0001 = 0.000100
da: l 1.0001 = 0.000100

source: Raw number output format: <placeholder-1/>
da: Rå nummer uddata format: <placeholder-1/>

source: = -s m ln 1.0001
da: = -s m l 1.0001

source: ln 1.0001 = 0.099995
da: l 1.0001 = 0.099995

source: Number output format with a specified SI prefix: <placeholder-1/>
da: Nummer uddata format med et specifikt SI Præfiks: <placeholder-1/>

source: Environment Variables
da: Miljø Variabler

source: HOME
da: HJEM

source: Determines where the .ralcalc_result file is stored.
da: Fastslår hvor .ralcalc_resultat filen vil blive gemt.

source: Exit Values
da: Afslutnings Værdier

source: Success
da: Succes

source: At least one error occurred.
da: Mindst en fejl opstod.

source: Files
da: Filer

source: ${HOME}/.ralcalc_result
da: ${HOME}/.ralcalc_resultat

source: The result of the most recent calculation, which can be accessed in a later calculation using the "_" character. Note that this is not necessarily portable across different machine architectures.
da: Resultatet af sidste udregning, kan blive tilgået i en senere beregning ved hjælp af "_" tegnet. Bemærk at dette ikke nødvendigvis er platforms uafhængig.

source: Diagnostics
da: Diagnostisering

source: <command>ralcalc</command> attempts to notify the user of as many errors as possible and indicate where those errors are, if they are user input related.
da: <command>ralcalc</command> vil forsøge at meddele bruger på så mange fejl som muligt og indikere hvad disse fejl er, såfremt de er bruger inddata relaterede.

source: <userinput>= 34/3@2</userinput> <computeroutput>Error: 34/3@2</computeroutput> ^ unknown token
da: <userinput>= 34/3@2</userinput> <computeroutput>Fejl: 34/3@2</computeroutput> ^ ukendt staffet

source: If an unknown character is included in the equation, an "<errortext>unknown token</errortext>" error will be generated. The error marker points to the invalid character. <placeholder-1/>
da: Såfremt et ukendt tegn er inkluderet i en ligning, vil en "<errortext>ukendt staffet</errortext>" fejl meddelelse blive genereret. Fejl meddelelsen vil forsøge af fremhæve de ugyldige tegn. <placeholder-1/>

source: <userinput>= 3.14.159x2.8^2</userinput> <computeroutput>Error: 3.14.159x2.8^2</computeroutput> ^ bad number
da: <userinput>= 3.14.159x2.8^2</userinput> <computeroutput>Fejl: 3.14.159x2.8^2</computeroutput> ^ forkert nummer

source: If an invalid number is included, a "<errortext>bad number</errortext>" error will be generated. The error marker points to the end of the invalid number. <placeholder-1/>
da: Såfremt et ugyldig tegn er inkluderet, vil en "<errortext>forkert nummer</errortext>" fejl meddelelse blive genereret. Fejl meddelelsen vil forsøge at fremhæve det ugyldige nummer. <placeholder-1/>

source: <userinput>= 5/[[2+3]*9</userinput> <computeroutput>Error: 5/[[2+3]*9</computeroutput> ^ mismatched brackets
da: <userinput>= 5/[[2+3]*9</userinput> <computeroutput>Fejl: 5/[[2+3]*9</computeroutput> ^ fejlplacerede klammer

source: If the number of open and close brackets do not match, a "<errortext>mismatched brackets</errortext>" error will be generated. The error marker position has no significance. <placeholder-1/>
da: Hvis placeringen af åben og luk klemmerne ikke passer, vil en "<errortext>Fejlplaceret klammer</errortext>" fejl meddelelse blive genereret. Fejlens markeringer har ingen betydning. <placeholder-1/>

source: <userinput>= 3^^7</userinput> <computeroutput>Error: 3^^7</computeroutput> ^ invalid operator
da: <userinput>= 3^^7</userinput> <computeroutput>Fejl: 3^^7</computeroutput> ^ ugyldig operatør

source: If an operator appears in an invalid position, an "<errortext>invalid operator</errortext>" error will be generated. The error marker indicated the invalid operator. <placeholder-1/>
da: Såfremt en operatør fremstår som ugyldig, vil en "<errortext>ugyldig operatør</errortext>" fejl meddelelse blive genereret. Fejl meddelelsen vil førsøge at indikere den ugyldige operatør. <placeholder-1/>

source: <userinput>= [2+]3</userinput> <computeroutput>Error: [2+]3</computeroutput> ^ invalid bracket <computeroutput>Error: [2+]3</computeroutput> ^ invalid operator
da: <userinput>= [2+]3</userinput> <computeroutput>Fejl: [2+]3</computeroutput> ^ ugyldig klamme <computeroutput>Fejl: [2+]3</computeroutput> ^ Ugyldig operatør

source: If a bracket appears in an invalid position, an "<errortext>invalid bracket</errortext>" error will be generated. This type of error often overlaps with other errors, so there will be a number of messages written to the screen. It is best to fix this error first as it will likely be the root cause of the problem. The error marker indicates the invalid bracket. <placeholder-1/>
da: Såfremt klemmerne er i en ugyldig position, vil en "<errortext>ugyldig klemme</errortext>" fejl meddelelse blive genereret. Denne type fejl, efterfølger gerne andre fejl, således at der vil blive genereret et antal af beskeder på skærmen. Det er ofte klogest at rette denne fejl først eftersom det er mest sandsynligt at den er skyld i alle fejlene. Fejl meddelelsen vil forsøge at indikere den ugyldige klemme. <placeholder-1/>

source: If <command>ralcalc</command> is unable to allocate some memory, an "<errortext>out of memory</errortext>" error will be generated.
da: Såfremt <command>ralcalc</command> ikke er i stand til at allokere hukommelse, vil en "<errortext>ikke mere hukommelse</errortext>" fejl meddelelse blive genereret.

source: Internal error: If the parser notices two numbers next to each other yet does not generate a "<errortext>bad number</errortext>" error, the a "<errortext>duplicate number</errortext>" error will be generated. This should never happen.
da: Intern fejl: Såfremt analyse værktøjet bemærker to tal side om side på en sådan måde det ikke generere en "<errortext>ugyldig nummer</errortext>" fejl meddelelse, vil en "<errortext>duplikeret nummer</errortext>" fejl meddelelse blive genereret. Dette burde dog aldrig ske.

source: Internal error: If an unknown error code is passed to the error output function, an "<errortext>unknown error</errortext>" will be generated and the invalid error code displayed. This should never happen.
da: Intern fejl: Såfremt ukendt fejl kode har nået fejl uddata funktionen, vil en "<errortext>ukendt fejl</errortext>" blive genereret og en ugyldig fejl kode vil blive vist. Dette burde dog aldrig ske.

source: Bugs
da: Fejl

source: Only a single "<option>-f <replaceable>filename</replaceable></option>" can be passed at once.
da: Kun én "<option>-f <replaceable>filnavn</replaceable></option>" kan blive benyttet af gangen.

source: If you find a bug, please submit a report at <uri type="webpage">http://bugs.launchpad.net/ralcalc</uri>
da: Såfremt du støder på fejl, venligst rapporter dette til <uri type="webpage">http://bugs.launchpad.net/ralcalc</uri>

source: Author
da: Forfatter

source: translator-credits
da: Launchpad Contributions: EFJoKeR https://launchpad.net/~jlassesen Jimmy Frydkær Jensen https://launchpad.net/~jimmy-frydkaer
