Repository: ralight/ralcalc
Catalog: man/po/ralcalc-*.1.po
Languages: es

source: a simple command line calculator
es: una simple calculadora de línea de órdenes

source: filename
es: nombre de archivo

source: prefix
es: prefijo

source: equation
es: ecuación

source: Description
es: Descripción

source: <command>ralcalc</command> is a command line calculator designed for very quick calculations where perhaps only a single result is wanted without having to start and then quit a program.
es: <command>ralcalc</command>es una calculadora de línea de comandos diseñada para cálculos muy rápidos, donde se muestra sólo un único resultado que se quiere sin tener que empezar y, a continuación, salir del programa.

source: <command>ralcalc</command> is also installed as the <command>=</command> command to make using it even quicker.
es: <command>ralcalc</command>también se instala como el comando <command>=</command> para hacer uso de él, incluso más rápido.

source: Options
es: Opciones

source: Print out all of the available operators, functions and constants.
es: Imprimir todos los operadores disponibles, las funciones y constantes.

source: Display the result in the "1e-3" form rather than using SI prefixes.
es: Mostrar el resultado en la forma "1e-3" en lugar de utilizar prefijos SI.

source: Process a list of calculations from a file. See the FILE INPUT section below for more information.
es: Procesar una lista de los cálculos desde un archivo. Vea la sección ARCHIVO DE ENTRADA más abajo para obtener más información.

source: Display usage, version and contact details.
es: Muestra el uso, versión y detalles de contacto.

source: Process a list of calculations from <filename class="devicefile">stdin</filename>. See the FILE INPUT section below for more information.
es: Proceso de una lista de los cálculos de <filename class="devicefile">stdin</filename>. Vea la sección ARCHIVO DE ENTRADA más abajo para obtener más información.

source: Only display the result (so hide the input and any errors).
es: Sólo muestra el resultado (para ocultar la entrada y los errores).

source: Display the result in decimal format with neither SI prefixes nor exponent.
es: Mostrar el resultado en formato decimal sin prefijos SI ni exponente.

source: Display the result using a particular SI prefix. This option is ignored if <option>-e</option> or <option>-r</option> is also used.
es: Mostrar el resultado usando un prefijo SI. Esta opción se ignora sí se utiliza la opción <option>-e</option> o <option>-r</option>.

source: Number Format
es: Formato de Número

source: Numbers should be input using either "." or "," as a decimal point (this is locale dependent so both may not work in your locale), with no thousands separators.
es: Números deben ingresarse usando "." ó "," como separador decimal (esto es depende del idioma del sistema, por lo tanto puede no funcionar en su idioma), no se utiliza separador de miles.

source: <command>ralcalc</command> supports SI prefix characters for both input and output: <placeholder-1/>
es: <command>ralcalc</command> soporta caracteres de prefijo SI tanto para entrada como para salida de datos: <placeholder-1/>

source: Numbers of the form 1e-3 are also supported, where the "e" indicates a power of ten. Don't mix and match SI prefixes and "e" in the same number (although 1e-3n is valid, 1ne-3 is not - avoid both for less confusion).
es: Números de la forma 1e-3 también son soportados, en donde la "e" indica una potencia de diez. No mezclar y combinar los prefijos SI y "e" en el mismo número (aunque 1e-3n es válida, 1NE-3 no es - evite ambos para menor confusión).

source: The SI prefixes supported are: Y, Z, E, P, T, G, M, k, m, u, n, p, f, a, z, y.
es: Los prefijos SI soportados son: Y, Z, E, P, T, G, H, K, M, u, n, p, f, a, z, y.

source: Operators
es: Operadores

source: The simple mathematical operators for addition (+), subtraction (-), multiplication (*, x), division (/) and power (^) are supported, with addition and subtraction having the lowest precedence and power having the highest. <placeholder-1/>
es: Los operadores matemáticos simples de adición (+), resta (-), multiplicación (*, x), división (/) y potencia (^) estás soportados, con la suma y resta con la más baja prioridad y la potencia con la más alta. <placeholder-1/>

source: Brackets ( (), [] ) can be used to control the order in which statements are processed: <placeholder-1/>
es: Paréntesis y corchetes ((), []) pueden ser utilizados para controlar el orden de procesamiento de las operaciones: <placeholder-1/>

source: Both the square and round brackets can be used and are both directly equivalent, so [1+2)x3 is also valid. Round brackets are more commonly used in mathematics, but the square brackets (and the "x" for multiplication) are included to try to prevent problems with the shell expanding those characters.
es: Tanto los paréntesis como los corchetes pueden ser utilizados equivalentemente, entonces [1+2)x3 es también válido. Los paréntesis se utilizan con más frecuencia en matemáticas, pero los corchetes (y la "x" para la multiplicación) son incluidos para evitar problemas.

source: <command>ralcalc</command> stores the result of the calculation so that it can be used in the next calculation with the "_" character. <placeholder-1/>
es: <command>ralcalc</command> almacena el resultado de un cálculo para que este pueda ser utilizados en el próximo cálculo con el caracter "_". <placeholder-1/>

source: Functions
es: Funciones

source: = sin2x2
es: = sen2x2

source: sin2x2 = 1.81859
es: sen2x2 = 1,81859

source: = sin[2x2]
es: = sen[2x2]

source: sin[2x2] = -0.756802
es: sen[2x2] = -0,756802

source: The functions <function>sin</function>, <function>cos</function>, <function>tan</function>, <function>asin</function>, <function>acos</function>, <function>atan</function>, <function>sqrt</function>, <function>log</function> (base 10 logarithm) and <function>ln</function> (natural logarithm) are supported. The trigonometric functions work on radians. The use of brackets is not necessary, but is recommended where precedence may be confusing. The functions have equal precedence to multiplication/division, so care must be taken: <placeholder-1/>
es: Las funciones <function>sin</function>, <function>cos</function>, <function>tan</function>, <function>asin</function>, <function>acos</function>, <function>atan</function>, <function>sqrt</function>, <function>log</function> (logaritmo en base 10) y <function>ln</function> (logaritmo natural) están soportadas. Las funciones trigonométricas se utilizan en radianes. El uso de paréntesis no es necesario, pero es recomendado en aquellos cálculos en los que la precedencia es confusa. Las funciones tienen igual precedencia que el producto/cociente, así que deben tomarse precauciones: <placeholder-1/>

source: Constants
es: Constantes

source: The constants <constant>pi</constant> (3.14159) and <constant>exp</constant> (2.71828) can be used and are treated the same as any other number.
es: Las constantes <constant>pi</constant> (3.14159) y <constant>exp</constant> (2.71828) pueden ser usadas y son tratados igual que cualquier otro número.

source: File Input
es: Archivo de Entrada

source: A list of calculations can be processed at once by placing them in a file. Each line of the file will be process exactly the same as if <command>ralcalc</command> had been run with those arguments. The file could look like the following (note the lack of the command <command>=</command> or <command>ralcalc</command>): <placeholder-1/>
es: Una lista de cálculos puede ser procesada colocándolos en un archivo. Cada línea del archivo será procesada exactamente igual que si se hubiese ejecutado <command>ralcalc</command> con esos argumentos. El archivo puede verse como el siguiente (tenga en cuenta la ausencia del comando <command>=</command> ó <command>ralcalc</command>): <placeholder-1/>

source: File input is also possible using <filename class="devicefile">stdin</filename>, i.e. reading interactively directly from the terminal with each line being calculated as normal. To quit, type "q" or "quit" on a new line, use Ctrl-D to indicate the end of file, or use Ctrl-C to cause <command>ralcalc</command> to be terminated.
es: Archivo de entrada también puede ser utilizado con <filename class="devicefile">stdin</filename>, i.e. lectura interactiva directamente desde el terminal, con cada línea calculada de la forma habitual. Para salir, escriba "q" o "quit" en una nueva línea, use Ctrl-D para indicar el final de archivo, o use las teclas Ctrl-C para terminar <command>ralcalc</command>

source: If either of the file input options are given on the command line, then any calculations given on the command line will be calculated first. If both of the file input options are given, then the calculations from the <option>-f</option> will be carried out first, followed by those from <filename class="devicefile">stdin</filename>.
es: Si cualquiera de las opciones del archivo de entrada son ingresadas desde la línea de comandos, entonces todos los cálculos ingresados por la línea de comandos serán calculados primero. Sí ambas opciones del archivo de entrada son ingresadas, entonces los cálculos de la opción <option>-f</option> serán calculados primero, seguidos por aquellos ingresados con <filename class="devicefile">stdin</filename>.

source: Examples
es: Ejemplos

source: Basic calculation: <placeholder-1/>
es: Cálculo básico: <placeholder-1/>

source: Exponent number output format: <placeholder-1/>
es: Formato de salida del número de exponente: <placeholder-1/>

source: Raw number output format: <placeholder-1/>
es: Formato de salida del número en crudo: <placeholder-1/>

source: Number output format with a specified SI prefix: <placeholder-1/>
es: Formato de salida de número con un prefijo SI especificado: <placeholder-1/>

source: Environment Variables
es: Variables de Entorno

source: Determines where the .ralcalc_result file is stored.
es: Determina donde se almacena el archivo .ralcalc_result

source: Exit Values
es: Valores de Salida

source: Success
es: Éxito

source: At least one error occurred.
es: Ha ocurrido al menos un error.

source: Files
es: Archivos

source: The result of the most recent calculation, which can be accessed in a later calculation using the "_" character. Note that this is not necessarily portable across different machine architectures.
es: El resultado del cálculo más reciente, al cual puede accederse mas tarde con el caracter "_". Tenga en cuenta que esto no es necesariamente portable a través de diferentes arquitecturas.

source: Diagnostics
es: Diagnósticos

source: <command>ralcalc</command> attempts to notify the user of as many errors as possible and indicate where those errors are, if they are user input related.
es: <command>ralcalc</command> intenta notificar al usuario de la mayor cantidad de errores posibles e indica donde están dichos errores, siempre y cuando estos estén relacionados con la entrada del usuario.

source: <userinput>= 34/3@2</userinput> <computeroutput>Error: 34/3@2</computeroutput> ^ unknown token
es: <userinput>= 34/3@2</userinput> <computeroutput>Error: 34/3@2</computeroutput> ^ símbolo desconocido

source: If an unknown character is included in the equation, an "<errortext>unknown token</errortext>" error will be generated. The error marker points to the invalid character. <placeholder-1/>
es: Sí se ingresa un caracter no válido en la ecuación, se generará un error de "<errortext>símbolo desconocido</errortext>". El marcador del error (^) indica el caracter inválido. <placeholder-1/>

source: <userinput>= 3.14.159x2.8^2</userinput> <computeroutput>Error: 3.14.159x2.8^2</computeroutput> ^ bad number
es: <userinput>= 3.14.159x2.8^2</userinput> <computeroutput>Error: 3.14.159x2.8^2</computeroutput> ^ número incorrecto

source: If an invalid number is included, a "<errortext>bad number</errortext>" error will be generated. The error marker points to the end of the invalid number. <placeholder-1/>
es: Si se incluye un número inválido, se generará un error de "<errortext>número incorrecto</errortext>". El marcador del error (^) indica el caracter inválido. <placeholder-1/>

source: <userinput>= 5/[[2+3]*9</userinput> <computeroutput>Error: 5/[[2+3]*9</computeroutput> ^ mismatched brackets
es: <userinput>= 5/[[2+3]*9</userinput> <computeroutput>Error: 5/[[2+3]*9</computeroutput> ^ paréntesis incorrectos

source: If the number of open and close brackets do not match, a "<errortext>mismatched brackets</errortext>" error will be generated. The error marker position has no significance. <placeholder-1/>
es: Sí el número de paréntesis y corchetes abiertos y cerrados no coincide, se generará un error de "<errortext>paréntesis incorrectos</errortext>". El marcador del error (^) indica el caracter inválido. <placeholder-1/>

source: <userinput>= 3^^7</userinput> <computeroutput>Error: 3^^7</computeroutput> ^ invalid operator
es: <userinput>= 3^^7</userinput> <computeroutput>Error: 3^^7</computeroutput> ^ operador inválido

source: If an operator appears in an invalid position, an "<errortext>invalid operator</errortext>" error will be generated. The error marker indicated the invalid operator. <placeholder-1/>
es: Sí un operador aparece en una posición inválida, se generará un error de "<errortext>operador inválido</errortext>". El marcador del error (^) indica el operador inválido. <placeholder-1/>

source: <userinput>= [2+]3</userinput> <computeroutput>Error: [2+]3</computeroutput> ^ invalid bracket <computeroutput>Error: [2+]3</computeroutput> ^ invalid operator
es: <userinput>= [2+]3</userinput> <computeroutput>Error: [2+]3</computeroutput> ^ paréntesis incorrecto <computeroutput>Error: [2+]3</computeroutput> ^ operador inválido

source: If a bracket appears in an invalid position, an "<errortext>invalid bracket</errortext>" error will be generated. This type of error often overlaps with other errors, so there will be a number of messages written to the screen. It is best to fix this error first as it will likely be the root cause of the problem. The error marker indicates the invalid bracket. <placeholder-1/>
es: Si un paréntesis aparece en una posición inválida, se generará un error de "<errortext>invalid bracket</errortext>". Este tipo de error normalmente se corresponde con otros errores, entonces habrá un número de mensajes escritos en la pantalla. Lo mejor es corregir este error primero, ya que probablemente sea la raíz de todos los demás problemas. El marcador del error (^) indica el paréntesis incorrecto. <placeholder-1/>

source: If <command>ralcalc</command> is unable to allocate some memory, an "<errortext>out of memory</errortext>" error will be generated.
es: Sí <command>ralcalc</command> es incapaz de asignar memoria, se generará un error de "<errortext>sin memoria</errortext>".

source: Internal error: If the parser notices two numbers next to each other yet does not generate a "<errortext>bad number</errortext>" error, the a "<errortext>duplicate number</errortext>" error will be generated. This should never happen.
es: Error interno: Sí el analizador encuentra dos números juntos, no genera un error de "<errortext>número inválido</errortext>", sino que se generará un error de "<errortext>número duplicado number</errortext>". Esto no debería de suceder nunca.

source: Internal error: If an unknown error code is passed to the error output function, an "<errortext>unknown error</errortext>" will be generated and the invalid error code displayed. This should never happen.
es: Error interno: Si un código de error desconocido se pasa a la función de salida de error, se generará un error de "<errortext>error desconocido</errortext>" y se mostrará el código de error. Esto no debería suceder nunca.

source: Only a single "<option>-f <replaceable>filename</replaceable></option>" can be passed at once.
es: Solo puede pasarse un "<option>-f <replaceable>nombre de archivo</replaceable></option>" a la vez.

source: If you find a bug, please submit a report at <uri type="webpage">http://bugs.launchpad.net/ralcalc</uri>
es: Si encuentra un error, por favor envíelo a <uri type="webpage">http://bugs.launchpad.net/ralcalc</uri>

source: Author
es: Autor

source: translator-credits
es: Launchpad Contributions: Feder Sáiz https://launchpad.net/~federsaiz-deactivatedaccount Federico Vera https://launchpad.net/~fedevera Paco Molinero https://launchpad.net/~franciscomol navnelson https://launchpad.net/~navnelson7-deactivatedaccount
