Repository: ralight/ralcalc
Catalog: po/*.po
Languages: da, es, eu, fr, fy, he, it, nl, pl, pt_br, tr, vi

source: out of memory
da: Ud af hukommelse
es: memoria insuficiente
eu: memoriatik kanpo
fr: dépassement de la mémoire
fy: gjin geheugen mear
he: חריגה מהזיכרון
nl: geen geheugen meer
pl: brak wolnej pamięci
pt_br: sem memória
tr: Yetersiz bellek
vi: hết bộ nhớ

source: bad input to function (internal)
da: dårlig inddata til funktion (internt)
es: Entrada a la función incorrecta (interno)
eu: funtziorako sarrera okerra (barnekoa)
fr: Entrée erronée dans la fonction (interne)
fy: slechte funksjeynfoer (yntern)
he: קלט שגוי לפונקציה (פנימי)
it: Input non corretto per la funzione (errore interno)
nl: slechte invoer voor functie (intern)
pl: nieprawidłowe argumenty wejściowe funkcji (wewn.)
pt_br: entrada ruim para função (interno)
tr: fonksiyon için kötü girdi (dahili)
vi: đầu vào sai cho hàm số (nội tại)

source: unknown token
da: ukendt staffet
es: símbolo desconocido
eu: ikur ezezaguna
fr: entrée invalide dans la fonction (interne)
fy: ûnbekinde token
he: אסימון לא ידוע
it: simbolo sconosciuto
nl: onbekend teken
pl: nieznany symbol
pt_br: símbolo desconhecido
tr: bilinmeyen işaret
vi: không rõ ký hiệu

source: bad number
da: dårligt tal
es: número incorrecto
eu: zenbaki okerra
fr: Nombre invalide
fy: net in nûmer
he: מספר שגוי
nl: slecht getal
pl: nieprawidłowa liczba
pt_br: número ruim
tr: kötü sayı
vi: số bị sai

source: mismatched brackets
da: fejl-placerede klammer
es: paréntesis incorrectos
eu: parentesiek ez dute bat egiten
fr: Problème dans les parenthèses
fy: slechte haakjes
he: סוגריים לא תואמים
it: parentesi poste in modo errato
nl: niet-overeenkomende haakjes
pl: nawias(y) bez pary
pt_br: parênteses inadequados
tr: eşleşmeyen parantez
vi: ngoặc không tương ứng

source: duplicate number
da: duplikat tal
es: número duplicado
eu: bikoiztutako zenbakia
fr: Nombre dupliqué
fy: dûbel nûmer
he: מספר כפול
it: numero duplicato
nl: dubbel getal
pl: dwie liczby bezpośrednio obok siebie
pt_br: número duplicado
tr: ikilenmiş sayı
vi: số trùng lặp

source: invalid operator
da: ugyldig operatør
es: operador inválido
eu: eragile okerra
fr: Opératuer invalide
fy: ûnjildige operator
he: פעולה שגויה
it: operatore non valido
nl: ongeldige bewerking
pl: nieprawidłowy operator
pt_br: operador inválido
tr: geçersiz işleç
vi: toán tử không hợp lệ

source: invalid bracket
da: ugyldige klammer
es: paréntesis inválido
eu: parentesis okerra
fr: Prenthèse invalide
fy: ûnjildig haakje
he: סוגר שגוי
it: parentesi non valida
nl: ongeldig haakje
pl: nieprawidłowy nawias
pt_br: parênteses inválido
tr: geçersiz parantez
vi: ngoặc không hợp lệ

source: unable to open file
da: ude af stand til og åbne fil
es: imposible abrir el archivo
eu: ezinezkoa fitxategia zabaltzea
fr: impossible d'ouvrir le fichier
fy: koe triem net iepenje
it: impossibile aprire il file
nl: kon bestand niet openen
pl: nie można otworzyć pliku
pt_br: impossível abrir arquivo
tr: dosya açılamıyor
vi: không thể mở file

source: unknown error (%d)
da: ukendt fejl (%d)
es: error desconocido (%d)
eu: errore ezezaguna(%d)
fr: erreur inconnue (%d)
fy: ûnbekinde flater (%d)
he: שגיאה לא ידועה (%d)
it: errore sconosciuto (%d)
nl: onbekende fout (%d)
pl: nieznany błąd (%d)
pt_br: erro desconhecido (%d)
tr: bilinmeyen hata (%d)
vi: lỗi không xác định (%d)

source: ralcalc version %s (build date: %s)
da: ralcalc version %s (skrevet dato: %s)
fr: ralcalc version %s (datebuild: %s)
he: גירסת ralcalc %s (תאריך הבניה: %s)
pl: ralcalc wersja %s (data kompilacji: %s)
pt_br: ralcal versão %s (data de construção: %s)
tr: ralcalc sürümü %s (oluşturulma tarihi: %s)

source: Copyright (C) 2007-2009 Roger Light http://atchoo.org/tools/ralcalc/
tr: Telif Hakkı (C) 2007-2009 Roger Light http://atchoo.org/tools/ralcalc/

source: ralcalc comes with ABSOLUTELY NO WARRANTY. You may distribute ralcalc freely as described in the COPYING file distributed with this program.
da: ralcalc kommer uden NOGEN FORM FOR GARANTI. Du må distribuere ralcalc frit som det er beskrevet i KOPIERINGS filen distribueret til dette program.
es: Racalc esta desprovisto de CUALQUIER GARANTIA. Usted puede distribuir racalc libremente como se indica en el archivo COPYING que acompaña a esta aplicación.
eu: racalc-ek ez du INOLAKO BERMERIK. Dohainik elkarbanatu dezakezu recalc programa honekin banatzen den COPYING fitxategian aipatzen den bezala.
fr: ralcalc n'offre AUCUNE GARANTIE. Vous pouvez distribuer ralcal gratuitement comme expliqué dans le fichier COPYING distribué avec ce programme.
he: ralcalc ללא כל אחריות כלל. תוכלו להפיץ את ralcalc בחינם כפי שמתואר בקובץ COPYING המושק יחד עם תוכנית זו.
it: ralcalc è distribuito SENZA ALCUNA GARANZIA. E' possibile distribuire ralcalc liberamente come descritto nel file di licenza (COPYING) distribuito assieme a questo programma
nl: ralcalc komt met ABSOLUUT GEEN GARANTIES. Je mag ralcalc gratis distribueren zoals beschreven in het COPYING bestand dat samen met dit programma geleverd is.
pl: ralcalc nie jest W ŻADNYM RAZIE OBJĘTY JAKĄKOLWIEK GWARANCJĄ. Można go swobodnie rozpowszechniać na zasadach opisanych w pliku COPYING.
pt_br: ralcalc não vem com ABSOLUTAMENTE NENHUMA GARANTIA. Você pode distribuir ralcalc livremente como descrito no arquivo COPYING que é distribuído junto com esse programa.
tr: ralcalc için HERHANGİ BİR GARANTİ VERİLMEMEKTEDİR. ralcalc'ı, programla beraber dağıtılan KOPYALAMA dosyasında anlatıldığı şekilde özgürce dağıtabilirsiniz.
vi: ralcalc được cấp mà KHÔNG CÓ BẢO HÀNH. Bạn có thể tự do phân phối ralcalc như được miêu tả trong file COPYING đi kèm theo chương trình.

source: ralcalc is a simple command line calculator.
da: ralcalc er en simpel kommando linje beregner.
fr: ralcalc est une calculatrice en ligne de commande.
he: ralcalc הינו מחשבון פשוט לשורת הפקודה.
it: ralcalc è un semplice calcolatore a linea di comando
pl: ralcalc to prosty kalkulator uruchamiany z wiersza poleceń.
pt_br: ralcalc é uma simples calculadora de linha de comando.
tr: ralcalc komut satırı ile çalışan basit bir hesap makinesidir.

source: Usage: ralcalc -h (display this text)
da: Brug: ralcalc -h (vis denne tekst)
es: Uso: ralcalc -h (muestra este mensaje)
eu: Erabilera: racalc -h (testu hau erakutsi)
fr: Utilisation; ralcalc -h (affiche ce texte)
fy: Gebrûk: ralcalc -h (dizze tekst sjen litte)
he: שימוש: ralcalc -h (הצגת טקסט זה)
it: Uso: ralcalc -h (mostra questo testo)
nl: Gebruik: ralcalc -h (geeft deze tekst weer)
pl: Wywołanie: ralcalc -h (wyświetla niniejszy tekst)
pt_br: Uso: ralcalc -h (mostra esse texto)
tr: Kullanımı: ralcalc -h (bu metni göster)
vi: Cách dùng: ralcalc -h (hiện những dòng chữ này)

source: ralcalc -a (display all available operators)
da: ralcalc -a (vis alle tilgængelige operatører)
es: ralcalc -a (muestra todos los operadores)
eu: ralcalc -a (erakutsi eragile eskuragarri guztiak)
fr: ralcalc -a (affiche tous les opérateurs disponibles)
fy: ralcalc -a (alle beskikbere operators sjen litte)
it: ralcalc -a (mostra gli operatori disponibili)
nl: ralcalc -a (geeft alle mogelijke bewerkingen weer)
pl: ralcalc -a (wyświetla wszystkie dostępne operatory)
pt_br: ralcalc -a (mostrar todas as operações possíveis)
tr: ralcalc -a (tüm mevcut işleçleri görüntüle)
vi: ralcalc -a (hiện tất cả các toán tử dùng được)

source: ralcalc [-e] [-f input file] [-i] [-q] [-r] <an equation>
fr: ralcalc [-e] [-f fichier d'entrée] [-i] [-q] [-r] <une équation>
tr: ralcalc [-e] [-f girdi dosyası] [-i] [-q] [-r] <bir denklem>

source: Options
da: Indstillinger
es: Opciones
eu: Aukerak
fy: Opsjes
he: אפשרויות
it: Opzioni
nl: Opties
pl: Opcje
pt_br: Opções
tr: Seçenekler
vi: Tùy chọn

source: -e Use the '1e-3' form of display for the answer rather than SI prefixes.
da: -e Benyt '1e-3' formen til at vise resultatet frem for SI præfikset.
es: -e Usa la notación '1e-3' en lugar de la notación de prefijo SI para mostrar los resultados.
eu: -e Erabili '1e-3' notazioa SI aurrizkien ordez emaitzak erakusteko.
fr: -e Utilise la forme d'affichage '1e-3' pour le résultat au lieu des préfixes SI.
fy: -e Brûk de '1e-3'-foarm foar it sjen litten fan it antwurd yn plak fan SI-prefixen.
it: -e Usa la forma '1e-3' per mostrare la risposta invece del prefisso SI
nl: -e Gebruik het '1e-3' formaat van weergave voor het antwoord in plaats van de SI prefixen.
pl: -e Wyświetlaj wynik w postaci "1e-3" zamiast stosować przedrostki SI.
pt_br: -e Utilize a forma '1e-3' de visualização do resultado ao invés de usar prefixos SI.
tr: -e Cevabı göstermek için SI önekleri yerine '1e-3' biçimini kullan.
vi: -e Dùng dạng '1e-3' thay vì tiền tố SI để hiển thị kết quả.

source: -f Process a list of calculations from a file.
da: -f Kør en liste af udregninger fra en fil.
es: -f Procesa una lista de operaciones apartir de un archivo.
eu: -f Prozesatu eragiketa zerrenda bat fitxategi batetik abiatuz.
fr: -f Exécute une liste d'opérations depuis un fichier.
fy: -f Behannelje in list fan berekkeningen út in triem.
it: -f Esegue un alista di computazioni da un file.
nl: -f Verwerk een lijst bewerkingen uit een bestand.
pl: -f Wykonuj obliczenia z listy zapisanej w pliku.
pt_br: -f Processa uma lista de cálculos a partir do arquivo.
tr: -f Dosyadan okunan hesaplamalar listesini işle.
vi: -f Thực hiện một loạt phép tính từ một file.

source: -i Process a list of calculations from stdin.
da: -i Kør en liste af beregninger fra stdin.
es: -i Procesa una lista de operaciones mediante la entrada standar stdin
eu: -i Prozesatu eragiketa zerrenda bat stdin sarreratik.
fr: -i Execute une liste d'opérations depuis stdin.
fy: -i Behannelje in list fan berekkeningen fan stdin.
it: -i Esegue una lista di calcoli da stdin
nl: -i Verwerk een lijst van berekeningen vanuit stdin.
pl: -i Wykonuj obliczenia z listy pobranej z wejścia standardowego.
pt_br: -i Processa uma lista de cálculos a partir da entrada padrão
tr: -i stdin'den okunan hesaplamalar listesini işle.
vi: -i Thực hiện một loạt phép tính từ stdin.

source: -q Only display the answer (quiet).
da: -q Vis kun svaret (Stille)
es: -q Solo muestra la solución (silencioso)
eu: -q Bakarrik emaitza erakutsi (quiet).
fr: -q N'affiche que le résultat.
fy: -q Allinnich it antwurd sjen litte (stil).
it: -q Mostra soltanto il risultato (quiet).
nl: -q Geef enkel het antwoord weer (stil).
pl: -q Wyświetlaj tylko wynik (tryb cichy).
pt_br: -q Mostra somente a saída (silencioso).
tr: -q Sadece cevapları görüntüle (sessiz).
vi: -q Chỉ hiện kết quả (kiểu im lặng).

source: -r Display the answer with neither SI prefixes nor exponents.
da: -r Vis svaret uden hverken SI præfiks eller eksponenter.
es: -r Muestra la solución sin prefijos SI ni exponentes.
eu: -r Erakutsi emaitza SI aurrizkirik gabe eta berretzailerik gabe.
fr: -r Affiche la réponse avec le préfixe le plus proche SI sans (nor) exposant
fy: -r It antwurd sjen litte sûnder SI-prefiksen as eksponenten.
he: -r הצג את התשובה בלי קידומות SI או מעריכחפ.
it: -r Mostra il risultato senza prefisso SI o esponenti.
nl: -r Geeft het antwoord weer zonder SI prefixen, noch exponenten.
pl: -r Wyświetlaj wynik nie używając przedrostków SI ani postaci wykładniczej.
pt_br: -r Mostra a resposta sem os prefixos SI nem expoentes.
tr: -r Cevabı SI önekleri ve üstel ifadeler olmadan göster.
vi: -r Hiện kết quả mà không có tiền tố SI hoặc số mũ.

source: See http://atchoo.org/tools/ralcalc/ for updates.
da: Se http://atchoo.org/tools/ralcalc/ for opdateringer.
es: Visite http://atchoo.org/tools/ralcalc/ para buscar actualizaciones
eu: Bisitatu http://atchoo.org/tools/ralcalc/ eguneratzeko.
fr: Allez sur http://atchoo.org/tools/ralcalc/ pour les mises à jour.
fy: Sjoch http://atchoo.org/tools/ralcalc/ foar updates.
he: בקרו באתר http://atchoo.org/tools/ralcalc/ לעדכונים.
it: Cosultare http://atchoo.org/tools/ralcalc/ per gli aggiornamenti
nl: http://atchoo.org/tools/ralcalc/ voor updates.
pl: Zajrzyj na stronę http://atchoo.org/tools/ralcalc/ w celu aktualizacji.
pt_br: Veja http://atchoo.org/tools/ralcalc/ para atualizações.
tr: Güncellemeler için http://atchoo.org/tools/ralcalc/ adresini ziyaret edin.
vi: Tìm kiếm bản cập nhật ở http://atchoo.org/tools/ralcalc/.

source: Numbers:
da: Tal:
es: Números:
eu: Zenbakiak:
fr: Nombres:
fy: Nûmers:
it: Numeri:
nl: Nummers:
pl: Liczby:
pt_br: Números:
tr: Sayılar:
vi: Các số:

source: 1.0 : example number
da: 1.0 : tal eksempel
es: 1.0 : número de ejemplo
eu: 1.0 : adibide zenbakia
fr: 1.0 : nombre d'exemple
fy: 1.0 : foarbieldnûmer
it: 1.0 : numero d'esempio
nl: 1.0 : voorbeeldnummer
pl: 1,0 : przykładowa liczba
pt_br: 1.0 : número de exemplo
tr: 1.0 : örnek sayı
vi: 1.0 : số được lấy làm ví dụ

source: 1.0e-3 : example number
da: 1.0e3 : tal eksempel
es: 1.0e-3 : número de ejemplo
eu: 1.0e-3 : adibide zenbakia
fr: 1.0e-3 : nombre d'exemple
fy: 1.0e-3 : foarbieldnûmer
it: 1.0e-3 : numero d'esempio
nl: 1.0e-3 : voorbeeldnummer
pl: 1,0e-3 : przykładowa liczba
pt_br: 1.0e-3 : número de exemplo
tr: 1.0e-3 : örnek sayı
vi: 1.0e-3 : số được lấy làm ví dụ

source: 1.0m : example number
da: 1.0m : tal eksempel
es: 1.0m : número de ejemplo
eu: 1.0m : adibide zenbakia
fr: 1.0m : nombre d'example
fy: 1.0m : foarbieldnûmer
it: 1.0m : numero d'esempio
nl: 1.0m : voorbeeldnummer
pl: 1,0m : przykładowa liczba
pt_br: 1.0m : número de exemplo
tr: 1.0m : örnek sayı
vi: 1.0m : số được lấy làm ví dụ

source: _ : previous result
da: _ : tidligere resultat
es: _: solución anterior
eu: _ : aurreko emaitza
fr: _: résultat précédent
fy: _ : foarich antwurd
it: _ : risultato precedente
nl: _ : vorig restultaat
pl: _ : poprzedni wynik
pt_br: _ :resultado anterior
tr: _ : önceki sonuç
vi: _ : kết quả trước

source: y, z, a, f, p, n, u, m : SI prefixes
da: y, z, a, f, p, n, u, m : SI præfiks
fr: Préfixes SI : y, z, a, f, p, n, u, m
it: y, z, a, f, p, n, u, m : prefissi SI
pl: y, z, a, f, p, n, u, m : przedrostki SI
pt_br: y, z, a, f, p, n, u, m : Prefixos SI
tr: y, z, a, f, p, n, u, m : SI önekleri

source: k, M, G, T, P, E, Z, Y : SI prefixes
da: k, M, G, T, P, E, Z, Y : SI Præfiks
fr: Préfixes SI : k, M, G, T, P, E, Z, Y
it: k, M, G, T, P, E, Z, Y : prefissi SI
pl: k, M, G, T, P, E, Z, Y : przedrostki SI
pt_br: k, M, G, T, P, E, Z, Y : Prefixos SI
tr: k, M, G, T, P, E, Z, Y : SI önekleri

source: Operators:
da: Operatører:
es: Operadores:
eu: Eragileak:
fr: Opérateurs :
it: Operatori:
nl: Bewerkingen:
pl: Operatory:
pt_br: Operadores:
tr: İşleçler:
vi: Các toán tử:

source: + : addition
da: + : sammenlægning
es: +: adición
eu: + : batuketa
fy: + : optelle
it: + : addizione
nl: + : optelling
pl: + : dodawanie
pt_br: + : adição
tr: + : toplama
vi: + : cộng

source: - : subtraction
da: - : subtraktion
es: -: sustracción
eu: - : kenketa
fr: - :soustraction
fy: - : ôflûke
it: - : sottrazione
nl: - : aftrekking
pl: - : odejmowanie
pt_br: - : subtração
tr: - : çıkarma
vi: - : trừ

source: * x : multiplication
da: * x : multiplikation
es: * x: producto
eu: * x : biderketa
fy: * x : fermenichfuldigje
it: * x : moltiplicazione
nl: * x : vermenigvuldiging
pl: * x : mnożenie
pt_br: * x : multiplicação
tr: * x : çarpma
vi: * x : nhân

source: / : division
da: / : dividering
es: /: cociente
eu: / : zatiketa
fy: / : dele
it: / : divisione
nl: / : deling
pl: / : dzielenie
pt_br: / : divisão
tr: / : bölme
vi: / : chia

source: %% : modulus
da: %% : modulær
es: %%: módulo
eu: %% : modulua
fr: %% : modulo
it: %% : modulo
nl: %% : restdeling
pl: %% : dzielenie modulo
pt_br: %% : módulo
tr: %% : kalan işlemi
vi: %% : lấy dư

source: ^ : power
da: ^ : potens
es: ^ : potencia
eu: ^ : berreketa
fr: ^ : puissance
fy: ^ : machten
it: ^ : elevamento a potenza
nl: ^ : macht
pl: ^ : potęgowanie
pt_br: ^ : expoente
tr: ^ : üs
vi: ^ : lũy thừa

source: () [] : brackets increase precedence
da: () [] : klammer forøger fortilfælde
es: () [] : los paréntesis y corchetes aumentan la precedencia
eu: () [] : parentesiak lehentasuna finkatzeko
fr: () [] : les parenthèsesaugmentent la précédence
it: () [] : parentesi ad incremento di precedenza
nl: () [] : haakjes veranderen de volgorde van de bewerking
pl: () [] : nawiasy wskazują działania wykonywane w pierwszej kolejności
pt_br: () [] : os parênteses aumentam a precedência
tr: () [] : parantezler önceliği artırır
vi: () [] : ngoặc để ưu tiên tính toán

source: Functions:
da: Funktioner:
es: Funciones:
eu: Funtzioak:
fr: Fonctions :
fy: Funksjes:
it: Funzioni:
nl: Functies:
pl: Funkcje:
pt_br: Funções:
tr: Fonksiyonlar:
vi: Các hàm số:

source: log X : logarithm to base 10 of X
da: log X : logaritme til base 10 af X
es: log X : logaritmo base 10 de X
eu: log X : X-en logaritmoa 10 oinarrian
fr: log X : logarithme en base 10 de X
fy: log X : Base-10-logaritme fan X
it: log X : logaritmo con base 10 di X
nl: log x : logaritme met basis 10 van X
pl: log X : logarytm o podstawie 10 z liczby X
pt_br: log X : logaritmo de X na base 10
tr: log X : 10 tabanında X'in logaritması
vi: log X : lôga cơ số 10 của X

source: ln X : natural logarithm of X
da: i X : naturlig logaritme af X
es: ln X : logaritmo natural de X
eu: ln X : X-en logaritmo nepertarra
fr: ln X : logarithme népérien de X
fy: ln X : natuurlik logaritme fan X
it: ln X : logaritmo naturale di X
nl: ln X : natuurlijk logaritme van X
pl: ln X : logarytm naturalny z liczby X
pt_br: ln X : logaritmo natural de X
tr: ln X : X'in doğal logaritması
vi: ln X : lôga tự nhiên của X

source: sin X, asin X : sine, arcsin of X
da: sin X, asin X : sine, arcsin af X
es: sin X, asin X : seno, arcoseno de X
eu: sin X, asin X : X-en sinua eta arkosinua
fr: sin X, asin X : sinus de X, Arcsinus de X
fy: sin X, asin X : sinus en asinus fan X
it: sin X, asin X : seno, arcoseno di X
nl: sin X, asin X : sinus en boogsinus van X
pl: sin X, asin X : sinus, arcus sinus z liczby X
pt_br: sin X, asin X : seno, arco do seno de X
tr: sin X, asin X : X'in sinüsü, arksinüsü
vi: sin X, asin X : sin, arcsin của X

source: cos X, acos X : cosine, arccos of X
da: cos X, acos X : cosine, arccos af X
es: cos X, acos X : coseno, arcocoseno de X
eu: cos X, acosX : X-en kosinu eta arkokosinua
fr: cos X, acos X : cosinus de X, Arccosinus de X
it: cos X, acos X : coseno, arcocoseno di X
nl: cos X, acos X : cosinus en boogcosinus van X
pl: cos X, acos X : cosinus, arcus cosinus z liczby X
pt_br: cos X, acos X : cosseno, arco do cosseno de X
tr: cos X, acos X : X'in kosinüsü, arkkosinüsü
vi: cos X, acos X : cos, arccos của X

source: tan X, atan X : tangent, arctan of X
da: tan X, atan X : tangent, arctan af X
es: tan X, atan X : tangente, arcotangente de X
eu: tan X, atan X : X-en tangente eta arkotangentea
fr: tan X, atan X : tangeante de X, Acrtangeante de X
it: tan X, atan X : tangente, arcotangente of X
nl: tan X, atan X : tangens en boogtangens van X
pl: tan X, atan X : tangens, arcus tangens z liczby X
pt_br: tan X, atan X : tangente, arco da tangente de X
tr: tan X, atan X : X'in tanjantı, arktanjantı
vi: tan X, atan X : tang, arctan của X

source: sqrt X : square root of X
da: sqrt X : kvadrat roden af X
es: sqrt X : raíz cuadrada de X
eu: sqrt X : X-en erro karratua
fr: sqrt X :racine carrée de X
it: sqrt X : radice quardata di X
nl: sqrt X : vierkantswortel van X
pl: sqrt X : pierwiastek kwadratowy z liczby X
pt_br: sqrt X : raiz quadrada de X
tr: sqrt X : X'in kare kökü
vi: sqrt X : căn bậc hai của X

source: Constants:
da: Konstanter:
es: Constantes:
eu: Konstanteak:
fr: Constantes :
fy: Konstanten:
it: Costanti
nl: Constanten:
pl: Stałe:
pt_br: Constantes:
tr: Sabitler:
vi: Các hằng số:

source: Error: Out of memory
da: Fejl : Ud af hukommelse
es: Error: Memoria insuficiente
eu: Errorea: Memoriatik kanpo
fr: Erreur: Dépassement de la mémoire
fy: Flater: gjin geheugen mear
nl: Fout: Geheugen vol
pl: Błąd: Brak wolnej pamięci
pt_br: Erro: Sem memória
tr: Hata: Yetersiz Bellek
vi: Lỗi: Hết bộ nhớ

source: Error: Invalid SI prefix '%s' for '-s' option.
da: Fejl: Ugyldig SI præfiks '%s' for '-s' indstillingen.
es: Error: Prefijo SI '%s' inválido para la opción '-s'.
eu: Errorea: SI aurrizkia baliogabea '%s' '-s' aukerarako.
fr: Erreur : préfixe SI '%s' incorrect pour l'option '-s'
it: Errore: Prefisso Si invalido '%s' per opzione '-s' .
nl: Fout: Ongeldige SI prefix '%s' voor '-s' optie.
pl: Błąd: Nieprawidłowy przedrostek SI "%s" przy opcji "-s".
pt_br: Erro: Prefixo SI '%s' inválido para a opção '-s'.
tr: Hata: '-s' seçeneği için geçersiz SI öneki '%s'.
vi: Lỗi: Tiền tố SI '%s' không hợp lệ với tùy chọn '-s'.

source: Error: Unable to open file "%s"
da: Fejl: Ude af stand til og åbne filen "%s"
es: Error: Imposible abrir el archivo "%s"
eu: Errorea: Ezinezkoa "%s" fitxategia zabaltzea
fr: Erreur: Impossible d'ouvrir le fichier "%s"
fy: Flater: Koe triem "%s" net iepenje
it: Errore: Impossibile aprire il file "%s"
nl: Fout: Kon bestand "%s" niet openen
pl: Błąd: Nie można otworzyć pliku "%s"
pt_br: Erro: Impossível abrir arquivo "%s"
tr: Hata: "%s" dosyası açılamıyor
vi: Lỗi: Không thể mở file "%s"

source: Unknown token (%d)
da: Ukendt staffet (%d)
es: Símbolo desconocido (%d)
eu: Ikur ezezaguna (%d)
fr: Code inconnu (%d)
he: אסימון לא ידוע (%d)
it: Simbolo sconosciuto (%d)
nl: Onbekend teken (%d)
pl: Nieznany symbol (%d)
pt_br: Símbolo desconhecido (%d)
tr: Bilinmeyen işaret (%d)
vi: Ký hiệu không xác định (%d)

source: Copyright (C) 2007,2008 Roger Light http://atchoo.org/tools/ralcalc/
he: כל הזכויות שמורות (C) 2007,2008 רובר לייט http://atchoo.org/tools/ralcalc/

source: ralcalc [-q] [-e] [-r] <an equation>
he: ralcalc [-q] [-e] [-r] <משוואה>

source: -q Only display the answer (quiet).
he: -q הצג את התשובה בלבד (שקט).

source: -e Use the '1e-3' form of display for the answer rather than SI prefixes.
he: -e השתמש בצורה '1e-3' להצגת התשובה מאשר קידומות SI.
